futures_company_top20 = [
    "永安期货",
    "银河期货",
    "中信期货",
    "国泰君安",
    "浙商期货",
    "国投安信期货",
    "广发期货",
    "东证期货",
    "光大期货",
    "中粮期货",
    "中信建投期货",
    "南华期货",
    "瑞达期货",
    "方正中期期货",
    "申银万国",
    "五矿期货",
    "华泰期货",
    "海通期货",
    "新湖期货",
    "宏源期货"
]

folder_directory_list = [
    "1永安期货",
    "2银河期货",
    "3中信期货",
    "4国泰君安",
    "5浙商期货",
    "6国投安信期货",
    "7广发期货",
    "8东证期货",
    "9光大期货",
    "10中粮期货",
    "11中信建投期货",
    "12南华期货",
    "13瑞达期货",
    "14方正中期期货",
    "15申银万国",
    "16五矿期货",
    "17华泰期货",
    "18海通期货",
    "19新湖期货",
    "20宏源期货"
]


futrues_varieties_filter_list = ['BB9999.XDCE', 'CY9999.XZCE', 'ER9999.XZCE', 'FB9999.XDCE', 'GN9999.XZCE',
                                 'JR9999.XZCE', 'LR9999.XZCE', 'PM9999.XZCE', 'RI9999.XZCE', 'RR9999.XDCE',
                                 'SS9999.XSGE', 'WH9999.XZCE', 'WR9999.XSGE', 'WS9999.XZCE', 'WT9999.XZCE',
                                 'LU9999.XINE', 'NR9999.XINE', 'RS9999.XZCE', 'B9999.XDCE', 'IF9999.CCFX',
                                 'IC9999.CCFX', 'IH9999.CCFX', 'TF9999.CCFX', 'T9999.CCFX', 'TS9999.CCFX',
                                 'BC9999.XINE', 'PK9999.XZCE', 'TC9999.XZCE', 'ME9999.XZCE', 'RO9999.XZCE']
